Revit 2027 API
BuiltInFailures.SketchFailures.PathReinforcementClosedLoop Property
 Sketch contains a closed loop. Can't create Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathReinforcementClosedLoop { get; }
Public Shared ReadOnly Property PathReinforcementClosedLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathReinforcementClosedLoop {
	FailureDefinitionId^ get ();
}
static member PathReinforcementClosedLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace